xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/03.controller_unit_sensor/system/libs/fwlib/py32l090_ll_dma.h
  uint32_t TransMode;                 /*!< Specifies data transfer mode.
                                           This parameter can be a value of @ref DMA_LL_EC_Transfer_Mode
                                           @note This configuration is used for data transfer between memory and peripherals,
                                                 not for data transfer between memory and memory. */
  
  uint32_t ArbMode;                   /*!< Specifies arbitration mode.
                                           This parameter can be a value of @ref DMA_LL_EC_Arbitration_Mode
                                           @note This configuration is used for data transfer between memory and memory. */
  
  uint32_t BTCSuspend;               /*!< Specifies BTC interrupt post-processing mode.
                                           This parameter can be a value of @ref DMA_LL_EC_BTC_Suspend
                                           @note This configuration is used for LL_DMA_MODE_FINITE_CIRCULAR mode and
                                                  LL_DMA_MODE_INFINITE_CIRCULAR mode, not for LL_DMA_MODE_NORMAL mode */

} LL_DMA_InitTypeDef;
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup DMA_LL_Exported_Constants DMA Exported Constants
  * @{
  */
/** @defgroup DMA_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_DMA_WriteReg function
  * @{
  */
#define LL_DMA_IFCR_CTCIF1                DMA_IFCR_CTCIF1       /*!< Channel 1 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF1               DMA_IFCR_CBTCIF1      /*!< Channel 1 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF1               DMA_IFCR_CHBTIF1      /*!< Channel 1 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF1                DMA_IFCR_CTEIF1       /*!< Channel 1 transfer error flag    */
#define LL_DMA_IFCR_CTCIF2                DMA_IFCR_CTCIF2       /*!< Channel 2 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF2               DMA_IFCR_CBTCIF2      /*!< Channel 2 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF2               DMA_IFCR_CHBTIF2      /*!< Channel 2 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF2                DMA_IFCR_CTEIF2       /*!< Channel 2 transfer error flag    */
#define LL_DMA_IFCR_CTCIF3                DMA_IFCR_CTCIF3       /*!< Channel 3 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF3               DMA_IFCR_CBTCIF3      /*!< Channel 3 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF3               DMA_IFCR_CHBTIF3      /*!< Channel 3 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF3                DMA_IFCR_CTEIF3       /*!< Channel 3 transfer error flag    */
#define LL_DMA_IFCR_CTCIF4                DMA_IFCR_CTCIF4       /*!< Channel 4 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF4               DMA_IFCR_CBTCIF4      /*!< Channel 4 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF4               DMA_IFCR_CHBTIF4      /*!< Channel 4 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF4                DMA_IFCR_CTEIF4       /*!< Channel 4 transfer error flag    */
#define LL_DMA_IFCR_CTCIF5                DMA_IFCR_CTCIF5       /*!< Channel 5 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF5               DMA_IFCR_CBTCIF5      /*!< Channel 5 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF5               DMA_IFCR_CHBTIF5      /*!< Channel 5 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF5                DMA_IFCR_CTEIF5       /*!< Channel 5 transfer error flag    */
#define LL_DMA_IFCR_CTCIF6                DMA_IFCR_CTCIF6       /*!< Channel 6 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF6               DMA_IFCR_CBTCIF6      /*!< Channel 6 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF6               DMA_IFCR_CHBTIF6      /*!< Channel 6 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF6                DMA_IFCR_CTEIF6       /*!< Channel 6 transfer error flag    */
#define LL_DMA_IFCR_CTCIF7                DMA_IFCR_CTCIF7       /*!< Channel 7 all block transfer complete flag */
#define LL_DMA_IFCR_CBTCIF7               DMA_IFCR_CBTCIF7      /*!< Channel 7 block transfer complete flag */
#define LL_DMA_IFCR_CHBTIF7               DMA_IFCR_CHBTIF7      /*!< Channel 7 block half transfer complete flag */
#define LL_DMA_IFCR_CTEIF7                DMA_IFCR_CTEIF7       /*!< Channel 7 transfer error flag    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_DMA_ReadReg function
  * @{
  */
#define LL_DMA_ISR_TCIF1                DMA_ISR_TCIF1       /*!< Channel 1 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF1               DMA_ISR_BTCIF1      /*!< Channel 1 block transfer complete flag */
#define LL_DMA_ISR_HBTIF1               DMA_ISR_HBTIF1      /*!< Channel 1 block half transfer complete flag */
#define LL_DMA_ISR_TEIF1                DMA_ISR_TEIF1       /*!< Channel 1 transfer error flag    */
#define LL_DMA_ISR_TCIF2                DMA_ISR_TCIF2       /*!< Channel 2 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF2               DMA_ISR_BTCIF2      /*!< Channel 2 block transfer complete flag */
#define LL_DMA_ISR_HBTIF2               DMA_ISR_HBTIF2      /*!< Channel 2 block half transfer complete flag */
#define LL_DMA_ISR_TEIF2                DMA_ISR_TEIF2       /*!< Channel 2 transfer error flag    */
#define LL_DMA_ISR_TCIF3                DMA_ISR_TCIF3       /*!< Channel 3 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF3               DMA_ISR_BTCIF3      /*!< Channel 3 block transfer complete flag */
#define LL_DMA_ISR_HBTIF3               DMA_ISR_HBTIF3      /*!< Channel 3 block half transfer complete flag */
#define LL_DMA_ISR_TEIF3                DMA_ISR_TEIF3       /*!< Channel 3 transfer error flag    */
#define LL_DMA_ISR_TCIF4                DMA_ISR_TCIF4       /*!< Channel 4 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF4               DMA_ISR_BTCIF4      /*!< Channel 4 block transfer complete flag */
#define LL_DMA_ISR_HBTIF4               DMA_ISR_HBTIF4      /*!< Channel 4 block half transfer complete flag */
#define LL_DMA_ISR_TEIF4                DMA_ISR_TEIF4       /*!< Channel 4 transfer error flag    */
#define LL_DMA_ISR_TCIF5                DMA_ISR_TCIF5       /*!< Channel 5 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF5               DMA_ISR_BTCIF5      /*!< Channel 5 block transfer complete flag */
#define LL_DMA_ISR_HBTIF5               DMA_ISR_HBTIF5      /*!< Channel 5 block half transfer complete flag */
#define LL_DMA_ISR_TEIF5                DMA_ISR_TEIF5       /*!< Channel 5 transfer error flag    */
#define LL_DMA_ISR_TCIF6                DMA_ISR_TCIF6       /*!< Channel 6 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF6               DMA_ISR_BTCIF6      /*!< Channel 6 block transfer complete flag */
#define LL_DMA_ISR_HBTIF6               DMA_ISR_HBTIF6      /*!< Channel 6 block half transfer complete flag */
#define LL_DMA_ISR_TEIF6                DMA_ISR_TEIF6       /*!< Channel 6 transfer error flag    */
#define LL_DMA_ISR_TCIF7                DMA_ISR_TCIF7       /*!< Channel 7 all block transfer complete flag */
#define LL_DMA_ISR_BTCIF7               DMA_ISR_BTCIF7      /*!< Channel 7 block transfer complete flag */
#define LL_DMA_ISR_HBTIF7               DMA_ISR_HBTIF7      /*!< Channel 7 block half transfer complete flag */
#define LL_DMA_ISR_TEIF7                DMA_ISR_TEIF7       /*!< Channel 7 transfer error flag    */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_DMA_ReadReg and  LL_DMA_WriteReg functions
  * @{
  */
#define LL_DMA_CCR_TCIE                   DMA_CCR_TCIE           /*!< All block transfer complete interrupt */
#define LL_DMA_CCR_BTCIE                  DMA_CCR_BTCIE          /*!< Block transfer complete interrupt */
#define LL_DMA_CCR_HBTIE                  DMA_CCR_HBTIE          /*!< Block half transfer complete interrupt     */
#define LL_DMA_CCR_TEIE                   DMA_CCR_TEIE           /*!< Transfer error interrupt    */
/**
  * @}
  */

